Radiacion/Malla100x100/Case-ViewFactor-Ra30000-test4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\ ========= | \\ / F ield | OpenFOAM: The Open Source 
  CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.1; 

writeControl    timeStep;

writeInterval   50; 

//purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxCo           50;
maxDeltaT       1;



// ************************************************************************* //

functions
{
     

     wallHeatFlux1
     {
         type        wallHeatFlux;
         libs        ("libfieldFunctionObjects.so");
         writeControl  writeTime;
         
     }

   
}



