Radiacion/Malla100x100/Case-ViewFactor-Ra30000-test4/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
  default Euler;   
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear upwind;
    div(phi,K)      bounded Gauss upwind;
    div(phiv,p)      bounded Gauss upwind;
    div(phi,h)      Gauss linear upwind;
    div(phi,e)      Gauss linear upwind; 
    div(phi,T)      Gauss linear upwind; 
    div(phi,(p|rho))    Gauss linear upwind;
    div(Ji,Ii_h)    bounded Gauss linearUpwind grad(Ii_h);
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U)))))  Gauss  linear upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
